app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      artist = Artist.find_by(id:params[:artist_id])
      @song = artist.songs.find_by(id:params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]