app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Artist.find(params:[artist_id]).songs
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "artists".* FROM "artists"
SELECT "songs".* FROM "songs"

  def show
    @song = Song.find(params[:id])
    if @song.blank?
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT "songs".* FROM "songs"